Revit 2027 API
ParameterTypeId.FabricationPartBoughtOut Property
 "Bought Out"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationPartBoughtOut { get; }
Public Shared ReadOnly Property FabricationPartBoughtOut As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationPartBoughtOut {
	ForgeTypeId^ get ();
}
static member FabricationPartBoughtOut : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace